[{"position":"President","name":"Jacqueline Wu","bio":"Jacqueline is a second generation Asian American, whose father originated from Shanghai, China and mother from Samar, Philippines. Born and raised in Los Angeles, Jacqueline moved north to Seattle to attend the University of Washington. At the UW, Jacqueline graduated with a B.A. in American Ethnic Studies and History (Honors) and minors in Labor Studies, Diversity, and Chemistry. In addition to OCA-GS and her commitment to school, Jacqueline is also involved at the International Examiner where she writes, archives, and coordinate events.","photo":"president.jpg"},
{"position":"Vice-President","name":"Connie So","bio":"Connie So is an immigrant from Kowloon, Hong Kong. She grew up in Seattle’s Beacon Hill neighborhood and graduated from the University of Washington with BAs in English and Communications. She received her Master’s in Public Administration from Princeton University and her Ph. D in Ethnic Studies (emphasis Political Science) at U.C. Berkeley. Since 1992, she has taught at the University of Washington’s American Ethnic Studies department. In 2002, she became a Senior Lecturer and the Supervisor of the Department’s Community Practicum and Internship.","photo":"vicepresident.jpg"},
{"position":"Treasurer","name":"Chi Saeturn","bio":"Chi Saeteurn was born in Seattle, Washington and grew up in Beacon Hill, Seattle. She is the daughter of Iu-Mien refugees that left Laos after Communist warfare broke out. She received her Bachelor’s Degree in American Ethnic Studies at the University of Washington in 2012 and currently works at the Seattle Public Library. Since 2012, Chi has been the Treasurer of OCA-Greater Seattle and organized its Golden Circle Dinner. She volunteers for the Iu-Mien American Association Enrichment Program, and spent the past year learning to read Mien. She enjoys watching comedy movies and learning about her Mien culture.","photo":"treasurer.jpg"},
{"position":"Co-Secretary","name":"Doug Chin","bio":"Doug Chin is the past OCA Greater Seattle chapter president. A Seattle native, he has been active in the local Asian American community since the 1970s and served on the OCA board in the early 2000s. He retired from Washington State government, where he worked as a policy analyst, facilities planner, and civil rights specialist, and the City of Seattle, as a project manager and policy planner. Doug and his brother Art, were co-authors of Uphill: The Settlement and Diffusion of Chinese in Seattle, Washington (1973) and Chinese in Washington State (2013). Doug authored Seattle’s International District: The Making of a pan-Asian American community (2001). He has a BA and MA in Sociology from San Francisco State, and a MA in Public Administration from the UW.","photo":"secretary1.jpg"},
{"position":"Co-Secretary","name":"Jael Yamamoto","bio":"Jael Yamamoto is of Japanese and Filipino descent. Her Nisei father grew up in Beacon Hill while her mother immigrated to the United States from Manila as a young child. Jael grew up in Bellevue, Washington. At the age of 10, her family moved to Newcastle, Washington. Jael is currently an undergraduate at the University of Washington, Seattle and is studying American Ethnic Studies. Jael works part-time while attending school.","photo":"secretary2.jpg"}]